In [1]:
import pandas as pd

# Load the Toyota sales and Sales Representatives datasets
toyota_data = pd.read_csv("data/car_sales/toyota_sales_data.csv")
sales_reps_data = pd.read_csv("data/car_sales/sales_reps_data.csv")

In [2]:
toyota_data.loc[0:4, ['sale_rep_id', 'sale_date', 'car_model', 'sale_amount']]

   sale_rep_id   sale_date car_model  sale_amount
0           16  2024-11-18    Tundra     44496.88
1           11  2024-11-08    Tacoma     34824.72
2            5  2024-11-03   Corolla     20275.08
3           20  2024-11-06   Corolla     20068.93
4            1  2024-11-26    Tundra     49811.99

In [4]:
toyota_data.iloc[0:5, 1:5]

   sale_rep_id   sale_date car_model  sale_amount
0           16  2024-11-18    Tundra     44496.88
1           11  2024-11-08    Tacoma     34824.72
2            5  2024-11-03   Corolla     20275.08
3           20  2024-11-06   Corolla     20068.93
4            1  2024-11-26    Tundra     49811.99

In [5]:
high_sales_loc = toyota_data.loc[
    toyota_data['sale_amount'] > 30000, 
    ['sale_rep_id', 'sale_date', 'car_model', 'sale_amount']
]

In [6]:
high_sales_loc

      sale_rep_id   sale_date   car_model  sale_amount
0              16  2024-11-18      Tundra     44496.88
1              11  2024-11-08      Tacoma     34824.72
4               1  2024-11-26      Tundra     49811.99
5              14  2024-11-28        RAV4     34346.20
6              12  2024-11-30        RAV4     33073.24
...           ...         ...         ...          ...
4990           20  2024-11-17  Highlander     36500.60
4992           10  2024-11-26      Tundra     47497.87
4994           12  2024-11-01      Tundra     41202.36
4997           18  2024-11-06      Tacoma     30780.39
4999           13  2024-11-21      Tundra     44525.85

[2976 rows x 4 columns]